back/app/controllers/identity/password_resets_controller.rb

  def create
    if @user = User.find_by(email: params[:email], verified: true)
---
SELECT "users".* FROM "users" WHERE "users"."email" = $1 AND "users"."verified" = $2 LIMIT $3  [["email", "yeukeiddegritru-1492@yopmail.com"], ["verified", true], ["LIMIT", 1]]