back/app/controllers/registrations_controller.rb

  def create
    @user = User.new(user_params)

    if @user.save
---
INSERT INTO "users" ("username", "email", "password_digest", "verified", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

  def destroy
    if Current.user.destroy
---
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 6]]