back/app/controllers/sessions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "faouzi3@gmail.com"], ["LIMIT", 1]]
---
  def create
    user = User.find_by(email: params[:email])

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
---
    def set_session
      @session = Current.user.sessions.find(params[:id])